v13/flowOverSphere/flowOverSphere/0/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<vector> 
135432
(
(0 4.52084e-16 0)
(0 -8.84221e-17 0)
(0 -1.6766e-16 0)
(0 1.67232e-16 0)
(-2.22636e-16 2.34811e-17 0)
(0 -1.54032e-16 0)
(2.22695e-16 5.04543e-17 0)
(-2.227e-16 -1.28287e-16 0)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
1600
(
(0 4.52084e-16 0)
(1.80384e-16 2.2526e-16 0)
(3.55938e-17 -2.24988e-16 0)
(3.13187e-17 -2.24858e-16 0)
(7.47169e-17 2.24864e-16 0)
(-2.41449e-18 2.24767e-16 0)
(-2.23575e-17 -0 0)
(2.9265e-16 -2.24223e-16 0)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
1600
(
(2.26057e-16 2.26057e-16 0)
(-2.25258e-16 -0 0)
(2.24988e-16 -0 0)
(-4.49715e-16 -2.24858e-16 0)
(0 -0 0)
(2.24767e-16 -0 0)
(2.24453e-16 -2.24453e-16 0)
(-4.48439e-16 -0 0)
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<vector> 
9600
(
(0 -0 0)
(1.80384e-16 -0 0)
(3.55938e-17 -0 0)
(3.13187e-17 -0 0)
(7.47169e-17 -0 0)
(-2.41449e-18 -0 0)
(-2.23575e-17 -0 0)
(2.9265e-16 -0 0)
...
)
;
    }
    sphere
    {
        type            calculated;
        value           nonuniform List<vector> 
2792
(
(8.29356 -264.093 0)
(264.093 -8.29277 0)
(8.38541 -8.38556 0)
(-8.38548 8.38535 0)
(-8.38547 -8.38559 0)
(8.38516 8.3853 0)
(-264.102 8.29732 0)
(-264.102 -8.29822 0)
...
)
;
    }
}


// ************************************************************************* //
